{"podcast_details": {"podcast_title": "Dan Murrell Podcast", "episode_title": "STREAMING: 2023's Breakout Show Is...Suits?!", "episode_image": "https://ssl-static.libsyn.com/p/assets/3/e/4/0/3e4091abcbcec91ae55e3c100dce7605/DMP_logo2.jpg", "episode_transcript": " Oh hi it's Zach Peter, your new favorite pop culture guru, serving you the hottest tea three times a week. From the latest news on The Real Housewives, deep dives into celebrity legal scandals, unfiltered convos with your favorite stars, and of course the latest from Vanderpumpland, I've Got Ya Covered, and new episodes of the podcast are now available in video on Spotify. And they don't just let anybody do video, but this platinum blonde has won them over. So if you want the latest news from the ultimate tea spilling professional, tune in to NoFilter with Zach Peter. That's NoFilter with Zach Peter on your favorite podcast app now. Hello everybody and welcome to another edition of Streaming Charts with Dan. It's been a while since I did an episode. It seemed like every time I had one planned, something came up or a news story broke or I just wasn't able to do it that week, so we actually have a couple of months worth of stuff to go through for Netflix and Nielsen and everything else. So we're just going to jump right into the data itself. And as we go, I'll stop and note some things that I was going to talk about. We have updates on the market share for streaming services. I want to talk about the ratings on Secret Invasion and this summer's breakout show, which isn't even a new show. It's one that premiered on the USA Network many, many years ago called Suits. So we're going to cover all that, but in the interest of time, let's jump into the charts will start as we always do with the most recent Amazon streaming charts. We're not going to go back into the historical records and look at everything week by week. We've got plenty of that. Let's look at what's hot right now on Amazon Prime Video. At number one is the Amazon Original Series, The Summer I Turned Pretty, which is the second season. We're going to start getting more Nielsen results from it soon, but indications are that it's doing quite well and it is really connecting with its intended audience. In second place is the new Amazon Original Series, Shelter, based on the book series by Harlan Coban about a New Jersey teen and the intrigue at his new high school. Cocaine Bear, which is currently streaming on Amazon Prime Video if you're a subscriber, is in third place, followed by The Lost Flowers of Alice Hart, which is an Australian series starring Sigourney Weaver. At number five is Red, White, and Royal Blue, the Amazon Original movie that debuted last week. It's based on a 2019 novel of the same name. As far as social media goes, it seems like it's been a pretty big hit. We'll see where it lands on the Nielsen charts in a couple of weeks. And third place is The Chosen, season three, which is produced from Angel Studios, who also released Sound of Freedom in theaters, so they're all over the charts this summer. In seventh place, the Amazon Original Series, Jack Ryan, which is wrapping up its run. At number eight is Good Omens II, the long-awaited second season of that show. M. Night Shyamalan's latest knock at the cabin is at number nine. And at number 10 is Jury Duty, one of the surprise hits of the summer. It was originally on Free V, which is Amazon's free streaming service. I think it was originally IMDB TV. It's now kind of prestige television, though. It's gotten nominated for multiple Emmys. It's one of the few TV series this summer that I have actually sat down and watched. And it is really, really funny. If you haven't seen Jury Duty, I don't think I even want to spoil the premise of it for you. It's just a really good time, and it's a pretty quick watch as well. Amazon Prime Video has had a pretty good summer as far as original programming, and it ties into something that I was going to center a whole show around, which is the market share. There are numbers that are released by Just Watch as far as what is the streaming market share for each specific streaming service. And this isn't based on viewership. That's something very key that I have to note here. It's based on the interest that Just Watch sees in the different programming on these different streaming services. If you don't know what Just Watch is, it's a website. You can put in a show name or a movie name, and it'll show you where they're streaming. And so they can kind of gauge what people are searching for, what they want to look at. And these were the changes I tracked from their reports going back to the fourth quarter of 2020 to the second quarter of 2023, which was the latest report released. And you'll see back in 2020 when I start this chart that Netflix had basically a 31% market share by Just Watch's metrics to Prime Video's 22% market share. Prime Video really hasn't risen that much. It's gone from 22 to 21%. But look at Netflix's share. It was at 31%. It's now at 20%, actually second behind Prime Video, less than three years after this chart began. And I think what this shows is what we've seen in these streaming wars so far, which is it's not necessarily that Prime Video has gained ground. It's that there's so much competition now that Netflix is no longer the undisputed king. It is just one of many streaming services that are out there scrapping. Probably the only one that improved its standing significantly from 2020 was what was then called HBO Max and is now currently Max. It was at a 9% share back in the fourth quarter of 2020. The latest results have it basically in third place at a 15% share. Hulu has fallen from 14% to 11%. Disney has stayed flat at 13%. And then you see Apple TV Plus going from 3% to 6%. Paramount Plus going from 3% to 7%. But they really are the also range. You can really see what the tiers are here, which is Netflix and Prime Video on top. Hulu, Disney Plus, and Max basically in the middle. And then everybody else kind of competing for their single digit slice of the pie down at the bottom. So this is a really interesting thing that I wanted to bring up because it's not based on viewership, like I said, but it does show where audience interest is going. And yeah, I mean, Netflix really is. And you know, the goal was to take the fight to Netflix. That's happened and now they are scrapping along with everybody else to be on top of that streaming race. They have a huge advantage. And really with Prime Video, you know, the question is always, well, how many of the users actually have it because they want to watch the programming that's on Prime Video and how many people have it because they have Amazon Prime? That's why I don't think that subscriber numbers are necessarily big. And that's why I like just watch as metrics. They may be a little harder to track, but audience interest, I think, is a very important component. Let's look at what's moving right now on the iTunes store. This was as of yesterday, August 19th at number one is No Hard Feelings, which just wrapped its theatrical run. It's now available for purchase on the iTunes store. Elemental is also available for purchase. It's in second place. Spider-Man Across the Spider-Verse also available for purchase in third place. John Wick Chapter four available for purchase and rentals in fourth place. Kandahar is in fifth place. Sisu is in sixth place. The Super Mario Brothers movie actually still in theaters, but also in seventh place on this chart. The low budget horror film Cobweb is in eighth place, followed by The Little Mermaid available for purchase only in ninth place and Guardians of the Galaxy volume three available for purchase only in tenth place. And three of those movies, Elemental, Little Mermaid, Guardians of the Galaxy volume three, those will all be on Disney plus fairly soon. But you can see that they're also already doing some video on demand numbers. And this is how Disney is going to try to weather the storm with so many box office disappointments this summer. All right, let's jump into the Netflix numbers. And like I said, we have about a two month backlog to get through. So I'm going to try to not really, you know, skip over important information, but try to get through these as quickly as I can. We're going to go back first to the week of June 19th through the 25th when Extraction Two was the top rated program on Netflix with 42.38 million views. In second place was the debut of the sequel Through My Window Across the Sea, which was a follow up to the Spanish streaming hit from last year. Take Care of Maya debuted in fifth place that week. It was a documentary about a girl's battle with a rare disease and her family struggle as she tries to get care. In sixth place was the debut of The Perfect Find, a romance starring Gabrielle Union and Keith Powers. Make Me Believe debuted in seventh place, a Turkish film about matchmaking grandmothers. In ninth place was the debut of the Clint Eastwood film The Mule, which has way more threesomes in it than you would expect. And in tenth place was the series The Surrogacy Season One. It's a series from Mexico about a woman who bears a child for a wealthy family and then has to understand the consequences of that. Oh, hi, it's Zach Peter, your new favorite pop culture guru, serving you the hottest tea three times a week from the latest news on The Real Housewives, deep dives into celebrity legal scandals, unfiltered combos with your favorite stars, and of course, the latest from Vanderpumpland, I've Got You Covered, and new episodes of the podcast are now available in video on Spotify. And they don't just let anybody do video, but this platinum blonde has won them over. So if you want the latest news from the ultimate tea spilling professional, tune in to No Filter with Zach Peter. That's No Filter with Zach Peter on your favorite podcast app now. Moving on to the next week, June 26th through July 2nd, that was the debut of the first part of The Witcher Season Three, which logged 73 million hours watched and 15.18 million views. It's good enough there for second place, although when you look at the numbers, it is a substantial drop off from the debut of Season Two. However, this was only five episodes versus the eight episodes, the full run of Season Two that debuted, but even given that, the numbers have really declined, even season over season from one to two and now from two to three for The Witcher. And of course, with the change and Henry Cavill leaving the show now, it's going to be interesting to see what the path forward for that show is. At one point, it was one of Netflix's most popular shows. The original film Run Rabbit Run, which Netflix acquired out of the Sundance Film Festival, debuted at sixth place on the week of June 26th with 8.45 million views. And then in ninth place was the debut of the South African film I Number Number, Josie Gold, which was a police film. Jumping forward to the next week, the week of July 4th here in the US, July 3rd through the ninth, The Outlaws, which was an original Netflix movie, debuted that week to 31.7 million hours watched and 19.69 million views. It was not popular critically, but it was popular with audiences. Kind of a criminal, meet the parents type film starring Pierce Brosnan and Ellen Barkin. The Lincoln Lawyer season two also split into two parts, had its debut for the first part of its second season and fourth place with 7.42 million views. Nimona was a film that was left without a home when Blue Sky Studios shut down after the Disney-Fox merger. Netflix took up distribution and promotion and it debuted to 6.73 million views in fifth place on the week of July 3rd. Unknown The Last Pyramid, an archaeological documentary, debuted in seventh place. In eighth place was Celebrity season one, putting the spotlight yet again on more South Korean movies and TV shows on Netflix and perhaps more to come. In ninth place is one of those movies that just pops up for whatever reason. Sniper Assassin's End with 5.38 million views, the eighth film in the Sniper series. It was originally released back in 2020. And in 10th place was the debut of season one of Fatal Seduction, which is a series out of South Africa. Coming out the week of July 10th through the 16th, that saw the debut of Bird Box Barcelona, which was the spin-off film of Bird Box, which is a big Christmas time hit a few years ago on Netflix. 30.5 million hours watched and 16.4 million total views, although coming in well behind the second week of The Outlaws, which brought in 28.76 million views in week two. The Lincoln Lawyer season two is in third place. In fourth place, a film that came out earlier and part of the licensing deal with Sony and Netflix, 65 with 6.77 million views total. I didn't love that movie, but it's been popular on streaming. In seventh place this week was Gold Brick, a French working class heist movie also released under the name Cash. And in eighth place, Puss in Boots, The Last Wish, which has been popular across a few different streaming platforms this year and this summer. Of course, a breakout hit at the box office in the holiday season and going into the early days of 2023, 5.53 million views for Puss in Boots. Looking at the week of July 17th through the 23rd, Bird Box Barcelona takes over the top spot with just over 19 million views and The Outlaws drops to second with 12.11 million views. In third place was the debut of Unknown Cave of Bones, a doc trying to show that an ancient cave may have actually held the bones not of humans, but of some unknown ape-like species. Sure, why not? In fourth place with the debut of the Netflix original film, They Clone Tyrone, a great cast, positive critical reception, but not a breakout Netflix hit. Love Tactics 2 debuted in sixth place. This is a sequel to the original 2022 film from Turkey. In seventh place is a series called King the Land. King the Land is a South Korean series. It sounds a bit like Succession in the hotel industry. You're not going to see it on this chart here because it does what I used to do, which is adjust the hours watched for total views, meaning people that watch the entire program. King the Land has many, many episodes, many, many hours of programming, so the total views of everything aren't very high. But if I were to sort by hours watched, King the Land I think is one of Netflix's 10 most watched series by actual length duration of watch of the year. And that's just a different way to view what people are watching. Are they finishing it or are they just watching a lot of it? And we'll talk about Suits, which is a show that doesn't show up in these Netflix charts because people aren't finishing it. But man, are they watching a lot of it this summer. Sweet Magnolia Season 3 debuted on the week of the 17th in eighth place with 4.6 million views and debuting in ninth place was The Deepest Breath with 4.59 million views. A documentary about free diving looks basically like the underwater version of Free Solo, which I love. So I've got to check this documentary out. Moving to the week of July 24th through July 30th, the number one program on Netflix was a film called Hidden Strike, 22 million hours watched, 12.82 million views. However, this is not a Netflix original film. It's also known as Project Extraction and it stars Jackie Chan and John Cena. The movie was actually filmed five years ago and is just now hitting Netflix. And that's because Netflix is the licensed distributor for Hidden Strike, which continues to be popular licensing in general across all streaming services. In second place is Miraculous, Ladybug and Cat Noir, a French animated film based on the 2015 series. Debuting in fourth place is the Netflix original film Happiness for Beginners starring Ellie Kemper, a rom-com there. In fifth place, Paradise, a German film about a man whose wife sells four decades of her life in order to pay off a debt. He then tries to get them back. That sounds like some pretty cool sci-fi. Maybe I'll check that one out as well. In sixth place was The Witcher, season three, returning for the second part of its third season with 59 million hours watched and total views of 7.76 million. It does bump down the chart a little bit because you added a bunch of watch time when you add those three additional episodes. In seventh place was Missing, the Lucy Blackman case, a true crime doc about a British tourist missing in Japan in the early 2000s. Centonia, season four, debuted in eighth place. This is an imported crime drama from Brazil. And then wrapping out the top 10 was Baki Hanma, season two, a Japanese. Oh hi, it's Zach Peter, your new favorite pop culture guru, serving you the hottest tea three times a week. From the latest news on The Real Housewives, deep dives into celebrity legal scandals, unfiltered combos with your favorite stars, and of course, the latest from Vanderpump Land, I've Got You Covered. And new episodes of the podcast are now available in video on Spotify. And they don't just let anybody do video. But this platinum blonde has won them over. So if you want the latest news from the ultimate tea spilling professional, tune in to No Filter with Zach Peter. That's No Filter with Zach Peter on your favorite podcast app now. He's anime series, wrapping out July, the week of July 31st through August six. Hidden Strike remained the most watched program on Netflix with 23.6 million views. Soul Catcher debuted in fifth place. This is a Netflix original film, a Polish movie about a weapon that turns people into murderers. A Perfect Story debuts on the charts in sixth place. This is a limited series out of Spain about a woman who runs away from her own wedding and the man that she meets after. In seventh place, returning with the second part of its second season, is The Lincoln Lawyer season two with 6.75 million views. In eighth place, Zom 100 Bucket List of the Dead. It has to be noted this is the live action adaptation of the anime, not the actual anime series, which is also charting on Netflix. It's about a man who feels liberated by the zombie apocalypse. And in ninth place, the popular teen drama series Heartstopper season two, which debuted with just over 6 million views. And now looking at the most recent Netflix chart, the week of August 7th through the 13th. In first place was the debut of Gal Gadot's Heart of Stone, easily taking the top spot with 33.1 million views total. And remember this is worldwide. Hidden Strike bumps down to second place. In third place was the documentary Untold Johnny Football about quarterback Johnny Menzel with 7.67 million views. Painkiller, a Netflix series about the opioid epidemic, rounds out the top five with 7.2 million views. And the only other new entry in the top 10 was the film What Men Want in seventh place with 5.98 million views. Looking at the Most Watched 2023 Netflix programs year to date, we have some changes because it's been a couple of weeks since we updated this chart. First of all, Extraction 2 really debuts on this chart at number two because of how well it did in its initial run. And it was giving the mother a run for its money. We'll see how it continues to put up those numbers through the next few weeks. Right now it has 123.74 million total views, which is about 12 million behind where the mother is right now. Murder Mystery 2, The Night Agent season one and Luther the Fallen Son all bump down. As do Queen Charlotte, You People and Your Place Are Mine. The Outlaws debuts in ninth place with 66 million total views, bumping Jenny and Georgia down to number 10. And then dropping off of this chart altogether are AKA. And then Wednesday, season one, keeping in mind this was just the amount of watch time that Wednesday generated in calendar year 2023, not counting all of the watch time it accumulated in 2022. The mother starring Jennifer Lopez has now officially entered the most watched Netflix films since Netflix started reporting this data back in June of 2021. It actually has generated more views than Glass Onion. It's at 136.36 million views with a lot of room to grow. We could be looking at it as high as number six by next week. Purple Hearts drops off of the top 10 for overall Netflix films. And then the other big mover was the first Extraction film, the bump in viewership that was generated from Extraction 2 was able to get it all the way up to number three. Red Notice and Don't Look Up are still the top watched Netflix films since data started being reported back in 2021. Looking at the most viewed Netflix programs overall since 2021, Extraction is now up to fifth place all time. Squid Game season one is at number one and Wednesday season one is at number two. Red Notice is at three. Don't Look Up is at four. Extraction we see there at number five. Then we have The Adam Project, the first Bird Box movie, Stranger Things 4, The Grey Man and We Can Be Heroes. Glass Onion now out of the overall top 10, keeping in mind this is all Netflix programming movies and series since June 28th, 2021. We have many, many more streaming charts to look at, but before we do, I want to thank the sponsors for this week's episode. This episode is brought to you by Babbel. And you know, the best way to learn a language is through immersion, living where that language is spoken natively and using it every day. But that's not possible for everybody. So what's the second best way? Well, that would be Babbel because with Babbel, you can start speaking a new language in just three weeks. Now, you could pay hundreds of dollars for a private tutor or try other language apps that are pretty much just games. Or you can give Babbel's quick 10 minute lessons a shot, which are designed by over 150 language experts. And these lessons aren't meant to make you sound like a student memorizing grammar from a textbook. Babbel's lessons are designed to allow you to sound like a native speaker of that language, regardless of your skill level. I've been traveling before in countries where I don't know the language and it's embarrassing to not know how to do basic things like ask for directions. But with Babbel, you can learn everything you need in Italian, Spanish, German, French, Portuguese, and so many more. Babbel has a wide range of learning experiences from casual to intense, which means that there's always a way to fit in a Babbel study session from self-study app lessons to podcasts, to live classes. Here's a special limited time deal for people watching and listening to the show to get you started right now. Get 55% off of your Babbel subscription, but only for people that watch the show at babbel.com slash dan. Get 55% off at babbel.com slash dan. That's spelled B-A-B-B-E-L dot com slash dan. Rules and restrictions may apply. This show is brought to you by AG1, a daily nutritional supplement that supports whole-body health. People are going back to school, the summer is winding down, but for a lot of folks that means you are busier than ever and you don't have time for that leisurely summer breakfast that you've been enjoying for the last few months. That also means it's the perfect time for AG1. I drink it every morning and it makes me feel like I'm covering my nutritional bases. Whether you're running out to class or you're traveling like I do a lot, the channel's always got me busy, whatever your excuse is, it's important to keep things on track when it comes to things like your immune system, your gut health, and so much more. I've struggled in the past with keeping to a routine, but drinking AG1 is fast and as simple as making a breakfast drink in the morning. It's just one scoop of powder mixed with water once a day and that's it. Each scoop is packed with 75 vitamins, minerals, and whole food sourced ingredients, and I also have some great single serving AG1 travel packs, so I never have to miss a day even when I'm on the go. With AG1, it's really that simple. If you want to take ownership of your health, try AG1 and get a free 1-year supply of Vitamin D and 5 free travel packs right now with your first purchase. Just go to www.drinkag1.com. That's www.drinkag1.com. to check it out. Let's move on now to the Nielsen charts, which track movies and shows not just on Netflix but across all streaming services, or at least most streaming services. This is just in the United States and there is, well, there's a delay because we haven't done the show in a couple months, and on top of that, there's even more of a delay in the reporting of the numbers. So we're actually going back to May to talk about some of these results. Let's jump right into it. First of all, this is the week of May 29th to June 4th, the 10 most watched streaming movies. The Boss Baby was at the top of this list with 8.9 million hours watched. Really the only two movies that were added were the surprise Oscar contender to Leslie at number seven and then the comedy We're the Millers at number eight, both of those movies on Netflix. Looking at the most watched streaming shows for May 29th through June 4th. Again, the same shows that were up on this chart last time we did the show still on top. Arnold Schwarzenegger's FUBAR at number one with 28.7 million hours watched and then SWAT, which has been generating a lot of watch time this summer at 23.4 million hours. And then the last season of Ted Lasso has also done really well. 20.7 million total hours watched from May 29th to June 4th. Manifest returned to the Nielsen chart this week, as did Heartland. These are both shows that have been on and off the charts for many different weeks. Looking at the most watched streaming movies for June 5th through the 11th. This week saw the debut of Avatar, The Way of Water, which is available on both Disney Plus and Max. I talked about this a little bit in an earlier video last week because of a licensing deal that Disney did with HBO. The movie is available on two different streaming platforms simultaneously and it had a great first week. 32.3 million hours watched easily by about 26 million hours. The most watched movie of the week. The Angry Birds movie debuted on the charts at number four and Disney Plus and Hulu's Flamin' Hot debuted at number five with 4.9 million hours watched. And then because it was the beginning of the month, we saw a bunch of new movies at number six through 10. Zoo Keeper on Netflix, Moana as always a perennial favorite on this chart on Disney Plus, Creed 3 streaming on Amazon, The Choice debuting on Netflix, and then Incanto on Disney Plus also returning to the chart. Looking at the most watched streaming shows June 5th through the 11th. It pretty much stayed the same. The only addition was the new season of Never Have I Ever on Netflix, which debuted with 15.2 million hours watched. Moving on to the next week, June 12th through the 18th. That was the week that Extraction 2 hit the charts, but Avatar The Way of Water stayed on top. 17.6 million hours watched. Extraction 2 debuting with just over 17 million hours watched, so almost a tie there for first place. The original Extraction hitting the charts again at number eight with 3.6 million hours watched and then returning to the charts at number 10 was Ant-Man and the Wasp, Quantumania on Disney Plus. Not a runaway streaming success according to Nielsen, but a return to the charts with 2.6 million hours watched. Looking at the most watched shows for the week of June 12th through the 18th. That was the week that the newest season of Black Mirror debuted on Netflix and it was the most watched program according to Nielsen with 22.6 million hours watched. Edging out SWAT in second place with 20.2 million hours watched. Grey's Anatomy also jumping onto the chart with 8.5 million hours watched. Again Grey's Anatomy always on and off this chart. One of the most popular shows across all streaming platforms. Of course here in the US it streams on Netflix. Moving now to June 19th through the 20th, Extraction 2 was able to take that top spot as far as streaming movies go with 17.2 million hours watched. Avatar The Way of Water dropped down to 11.1 million hours for second place. In third place on Netflix was the film The Mule starring Clint Eastwood with just over 8 million hours watched and again just an uncomfortable amount of threesomes in that film. In fourth place the documentary Take Care of Maya with 6.6 million hours watched. Good enough for a top 5 debut there. The Perfect Find, 47 Ronin and Unbroken all films on Netflix that broke into the top 10 at number 7, number 8 and number 10. The most watched streaming shows for the week of June 19th through the 25th. This was the week that Suits first hit the charts with a vengeance and there was no slow climb for Suits on the Nielsen streaming charts. The week of the 19th through the 25th of June Suits put up 38.6 million hours watched. Easily the most watched show. It's streaming on Peacock and Netflix. Netflix has seasons 1 through 8. Peacock has all 9 seasons. Black Mirror bumped down to second place with 25.8 million hours watched. Hulu's The Bear also premiering that same week, a top 5 debut, 14.2 million hours watched. And then the Surrogacy on Netflix breaking into the top 10 with 9.7 million hours watched. But let's take a moment to address Suits because over the next few minutes as we look at the most watched streaming shows week to week, you're going to start seeing the unbelievable numbers that Suits has been putting up. And when I say unbelievable, I mean in the history really of the Nielsen streaming charts, which there have been charts going back to 2020 that I have an archive of, I can go back and look at. There are only two shows that have been able to draw viewership at the size and consistency that we've been seeing from Suits. One of them is Stranger Things and the other one is Wednesday, which are huge, massive mega hits for Netflix and also original series. Suits is really an uncharted territory, no pun intended, for a licensed program. In the last couple of weeks, Suits has put up either close to a top 10 or a top 10 performance for any series, library, original, it doesn't matter, since this data was first published in 2020. There's really no explanation as to why Suits has become such a breakout hit. If you're not familiar with what Suits is, it's a legal drama that ran on the USA Network here in the United States from June 2011 to September 2019. It had good for cable ratings. Season one drew about 4 million viewers, but the show dipped to under a million viewers in its final season. Prior to its streaming resurgence, it was perhaps best known for featuring Meghan Markle as one of its cast members, who of course now is married to Prince Harry. She's the Duchess of Sussex. But there was no indication that this was going to be the summer of Suits on streaming. In a weird way though, it ties into another huge phenomenon that we've seen on my other show, Charts with Dan, where I talk about the box office, which is what Barbie and Oppenheimer have been doing. And it may seem like those two things aren't really connected, but because of the strikes that have been going on right now, the actors and the writers both currently on strike with the writers at the table, hopefully they will be able to hammer out a deal soon. But the success of Barbie and Oppenheimer, in my opinion, and a lot of analysts have said the same way, only really underscored the value of the artists that were on strike, because the studios couldn't really say that they weren't making money off of movies when both of those movies, and particularly Barbie, were setting record numbers at the box office. And so it sort of bolstered the case of the actors and writers that are on the picket lines. Suits here, a very similar case. Suits is putting up all time numbers, and yet you have people who wrote on that series saying, hey, here's the residual check that I got. It's for like $3,000. Meanwhile, Suits is putting up 30, 40, 50, 60 million hours of watch time per week, and it really only underscores the unfairness of the current residual system, especially when it comes to streaming. Performance-based residuals are a key component of the writer strike. Actors are also asking for transparency and a reform of the residual system, and the success of Suits has put a spotlight on that. So these weird, organic things that have happened, people going to see Barbie in the theaters, people watching Suits on streaming, have actually worked in favor of the writers and actors because it's allowed them an example, a recent example that they can point to to show why they're on... Oh hi, it's Zach Peter, your new favorite pop culture guru, serving you the hottest tea three times a week from the latest news on The Real Housewives, deep dives into celebrity legal scandals, unfiltered combos with your favorite stars, and of course, the latest from Vanderpumpland, I've Got You Covered, and new episodes of the podcast are now available in video on Spotify, and they don't just let anybody do video, but this platinum blonde has won them over. So if you want the latest news from the ultimate tea spilling professional, tune in to No Filter with Zach Peter. That's No Filter with Zach Peter on your favorite podcast app now. And strike and the value that they bring to the table. So let's continue to track Suits across these next couple weeks. Let's look at the week of June 26 through July 2nd. The movie chart stayed mostly the same, Run Rabbit Run debuted in third place in the US with 5.5 million hours watched. Megan returns to the streaming movie chart because it's streaming now on Prime Video with just over 3 million hours watched. And then The Boss Baby, another perennial favorite, returned to the chart at number nine. So let's look at what Suits did in its second week on this chart. June 26 through July 2nd, it put up 52.3 million hours of watch time. It more than doubled the second place show, which was The Witcher on Netflix with 21.8 million hours watched. That's usually easily a first place number. The Bear on Hulu also putting up strong numbers, 16.8 million hours watched in third place. Jack Ryan on Amazon Prime Video returning to the chart at number seven with 12.9 million hours watched. The Big Bang Theory on Max, another show that you see on this chart off and on quite a bit with 10 million hours watched. Going now to July 3rd through the ninth, that was the week that The Outlaws hit Netflix. It was the most watched film on streaming with 11.8 million hours watched. Sadly because of tragic real life events, there was an uptick in interest in the movie Titanic. It was in second place the week of July 3rd through the ninth with just over 7 million hours watched. 65 on Netflix was in third place with 6.1 million hours watched. White House Down debuted in fifth place with 4.4 million hours watched. Nimona debuted in sixth place with 4.3 million hours watched. And then Annihilation, one of my favorite recent sci-fi films, debuting in ninth place with just over 4 million hours watched on Netflix. When we go to the most watched shows, Suits keeps growing. 61.2 million hours watched in week three on the streaming charts. That's nearly triple what the second place show was, which was The Lincoln Lawyer on Netflix. It was about 23.4 million hours watched. The Witcher down there at number three. The only other new show debuting was Is It Cake 2 on Netflix. It debuted in ninth place with 12.5 million hours watched. Looking at the most watched streaming movies for the next week, that would be July 10th through the 16th. The Outlaws stays at number one. 65 moves up to number two. Puss in Boots, The Last Wish debuts there or actually returns to the chart at number three with 9.4 million hours watched. Bird Box Barcelona debuts at number four with 6.4 million hours watched. Then we had Transformers Rise of the Beasts. Its debut on Paramount Plus. Put it just outside the top five at number six with just over 4 million hours watched. Captain Underpants debuting at number seven with 3.5 million hours watched. And The Tudor on Netflix debuting in ninth place with 3.3 million hours watched. And then looking at the most watched streaming shows, Suits week four. Pretty much holding steady with the week before, 61.6 million hours watched. Bluey on Disney Plus though, a strong second place. Bluey has really been growing in popularity. It is even easily now displacing or trouncing Cocoa Melon, which was the undisputed kids show. Bluey I think has a lot more crossover appeal, which is why you're seeing it perform well. It also had new episodes that debuted this summer. But still, second place with 22.5 million hours watched. Netflix's quarterback has a top five debut with 14.2 million hours watched. And speaking of Cocoa Melon, it returns to the charts on the week of July 10th through the 16th in ninth place with 10.8 million hours watched. Moving on now to the week of July 17th through the 23rd, Puss in Boots, The Last Wish moves up to the most watched film on streaming. They cloned Tyrone on Netflix at 7.8 million hours watched, good enough for number two. Unknown Cave of Bones debuts there in fifth place. Ride Along, a licensed film, debuts at sixth place with 4.6 million hours watched. And Encanto on Disney Plus returns at the number 10 spot. Usually if it's a slow week on streaming for movies, you can count on Encanto to return. Moana is in the top 10 pretty much every week. And then look at this. This is the most recent chart, by the way, that we have available from Nielsen for the week of July 17th through the 23rd. But Suits keeps growing. 64.6 million hours watched. So this wasn't just people watching it for one week. This is now a month of sustained, almost top 10 all time viewership. Bluey in second place with 20.3 million. So you can see that Suits actually did more than triple the second place streaming show on this chart. Sweet Magnolias on Netflix almost took that number two spot. It was just about 16,000 hours short of having more watch time than Bluey. The rest of the top 10 list stays the same. And looking at watch time per available episode. I didn't do this for all the other weeks because there's only so much time in the day. Secret Invasion is a show that we haven't talked about. It's a new MCU show. When you look at watch time per available episode, it's actually number one. This is through five episodes. It's putting up 1.37 million hours watched per episode. That's only just barely good enough for number one. It was actually number two in the week before. Netflix's quarterback is at 1.35 million hours watched per episode. The Lincoln Lawyer in second place with 780,000 hours watched per episode. The Samurai turned pretty at number four with 746,000 hours watched per episode. Then Sweet Magnolias in fifth place. But this just goes to show you how well Suits is doing. Shows that have a lot of episodes generally don't show up on this chart because you're dividing that watch time by a lot more each week. The more episodes there are, the more that this watch time per episode is kind of diluted down. But even though there's 136 episodes, Suits is still good enough for sixth place on this chart. Every single episode of Suits was generating 475,000 hours watched each on average. That's pretty crazy. Coco Mel and Jack Ryan, The Witcher, and The Bear round out the top 10 there. But let's talk a little bit about Secret Invasion. I'm working on my own video, not necessarily a review, more of an essay, but also giving my thoughts on the show that'll be out at some point in the next, you know, I don't know, sometime in the future. But this is a show that of course is adapting a very popular, very successful comic book storyline. Many people thought that Secret Invasion would be perhaps an entire phase of the MCU. So it was a little bit surprising when Marvel announced that it was going to be a Disney Plus show. However, you know, if they could pull it off, then perhaps this would just be another way to tell the story. But through five episodes, Secret Invasion is not putting up the kind of numbers you would expect for a storyline that is so significant and so revered among comic book readers. First of all, these are the Disney Plus MCU TV series by Total Watch Time in millions of hours. Now, of course, Secret Invasion is going to be a little bit of a disadvantage because this is only through five episodes. But that also means there's only one new episode left to hit the charts. And right now it is only beating Ms. Marvel and What If as far as total viewership. It is about 17 million hours shy of the total watch time for She-Hulk. She-Hulk did have more episodes, but it was also a shorter show and really well short of shows like Moon Knight, Hawkeye, Falcon and the Winter Soldier, WandaVision and then Loki. Loki has so far the most total watch time as far as reported hours on Nielsen at 96.6 million hours. That's just for season one. WandaVision in second place with 90 million hours. So Secret Invasion not putting up the numbers that you expect from these prestige MCU shows on Disney Plus, the ones that really were consequential to the MCU and had people buzzing. Looking at hours watched per episode. So it's sort of like the chart we were looking at before, where I take the total runtime and divide it by how many episodes were released. Secret Invasion fares a little better. It's doing better as far as watch time per episode than She-Hulk did. She-Hulk averaged about 5.8 million hours of watch time per episode. Secret Invasion is averaging about 7 million hours of watch time per episode. But again, that's well short of WandaVision, which had 10 million hours of watch time per episode. Moon Knight, Hawkeye, Falcon and the Winter Soldier all ahead of that. And then Loki season one, which averaged 16.1 million hours watched per episode. So again, Secret Invasion near the bottom of the MCU as far as total watch time, near the bottom of the MCU on Disney Plus as far as watch time per episode. And then looking at hours watched through five episodes. So this is each of these shows runs through the first five episodes that were aired. Again so that you're not comparing a partial run versus a full run. Loki season one had already put up 70.3 million hours of watch time through its first five episodes. Hawkeye surprisingly was in second place with 57.6 million hours of watch time. Followed by the Falcon and the Winter Soldier at 55.9 million. Moon Knight at 49.58 million. WandaVision at 40.4 million hours watched through five episodes. A lot of people might be surprised by that, but when you look at the numbers for WandaVision, they were heavily back loaded. WandaVision was actually a very popular show. You could see that when we looked at total watch time, but people were watching it later on in its run. I think it's probably because it was the first MCU show. So people may not have been watching the first few weeks, but they were tuning in toward the end. We're not seeing that kind of pattern developing here with Secret Invasion. Right now through five episodes, Secret Invasion is trailing every MCU series on Disney Plus. Other than She-Hulk, What If, and then Ms. Marvel. Ms. Marvel, we don't even have complete ratings data for it. It didn't even make the chart for many of its weeks. It was easily, sadly, the least watched MCU show. But again, this is a very mediocre performance in my opinion for Secret Invasion and certainly not worthy of the storyline that it is adapting. So this is something to keep an eye on. Let's see what happens with Loki Season 2, which is debuting soon in the fall. If it's able to put up numbers that are similar to Loki Season 1 or even two thirds of Loki Season 1, then it may just be that people aren't connecting to this specific series. But if Loki's numbers drop more substantially or even puts up similar numbers to Secret Invasion, then we could be seeing a sharp decline for Disney overall when it comes to Marvel shows on Disney Plus. Something to watch for, the box office results haven't been stellar for some of the MCU movies recently. Some of the movies have been hits, some of them not so much. And now it seems like the TV shows are losing a bit of luster as well, given that Marvel is one of Disney's crown jewel. Oh hi, it's Zach Peter, your new favorite pop culture guru, serving you the hottest tea three times a week. From the latest news on The Real Housewives, deep dives into celebrity legal scandals, unfiltered combos with your favorite stars, and of course the latest from Vanderpumpland, I've Got You Covered, and new episodes of the podcast are now available in video on Spotify. And they don't just let anybody do video, but this platinum blonde has won them over. So if you want the latest news from the ultimate tea spilling professional, tune in to No Filter with Zach Peter. That's No Filter with Zach Peter on your favorite podcast app now. I'm sure that's not the news that they want at this point in time. These are the most watched streaming movies for 2023 through July 23rd, which is when we have data. And again, this is a big update because it's been a couple months since we looked at this chart. Avatar the Way of Water is now the second most watched streaming movie of the year. Black Panther Wakanda Forever was number one last time we looked at this chart, but the movie that's actually taken over the number one spot, and again, just by consistently being in the top 10 every week, is Moana. Moana so far has generated 88.3 million hours of watch time, a substantial lead over Avatar the Way of Water and Black Panther Wakanda Forever. And again, more evidence that yes, original movies, original shows are an important aspect of streaming services, but library content, licensed content as well, is really leading the way in many cases. Suits right now on Netflix, Moana the most watched show on streaming this year so far. New People drops down to number four, and Kanto enters the top 10 for the year at number five. A Man Called Otto, The Mother, and Minions, The Rise of Gru all drop down on the chart. Extraction 2 debuts at number nine as the ninth most watched streaming film of the year. And Puss in Boots, The Last Wish, it was on Peacock earlier this year. It's now streaming on Netflix. It debuts at number 10. Luther the Fallen Son, Your Place or Mine, and Murder Mystery 2 all drop off of the chart for the year so far. Looking at the most watched original streaming series for 2023, again, these are series that are made specifically for streaming services or that debut exclusively on streaming services here in the U.S. Bluey has actually, I never thought this was possible, displaced Coco Mellon. Now, some people say, well, Bluey's not an original streaming series here in the U.S., at least right now, maybe not historically, but right now, Bluey debuts new episodes on Disney Plus exclusively. So this is why I have Bluey as an original streaming series. And it has now put up more hours watched than Coco Mellon. I mean, this really is a changing of the guard. 361.3 million hours watched versus Coco Mellon's 350 million hours watched. Ted Lasso is the third most watched original streaming series of the year. Although a steep drop off from Bluey and Coco Mellon, it's at 181.3 million hours watched. Jenny and Georgia and The Night Agent all taking a drop but still in the top five. You, The Last of Us, Outer Banks, The Mandalorian, and Love is Blind rounding out the top 10. Looking at the most watched library streaming series, and you can see that just in the last few weeks, Suits has made a lot of noise on this chart. NCIS right now, the most watched library streaming series of the year and the most watched series of the year overall at 367.8 million hours watched. But in just a month, Suits is now in second place with 278.5 million hours watched. And if it keeps putting up weeks like we've been seeing, it will be at number one within two or three weeks, displacing NCIS. Grey's Anatomy falls to number three, The Big Bang Theory falls to number four. I mentioned that SWAT has been generating a lot of watch time the last few weeks. It's now at number five as far as most watched library series. The Walking Dead is at six, South Park is at seven, New Amsterdam is at eight, Heartland is at number nine, Gilmore Girls drops to number 10, and we lose Shameless, Supernatural, and Friends from this list. Suits has not yet cracked the most watched library streaming series overall since 2020 when we started collecting data, although it is close. I can tell you the top five remains unchanged. Really the only things that have changed are in that six through 10 area. The Big Bang Theory moves up to number seven, The Office and Schitt's Creek both dropping one spot to numbers eight and nine. We'll see if there is any threat to these shows once Suits keeps doing what it's doing, but no big changes in that top 10 right now. Looking at the most watched original streaming series since 2020, again, no new additions just shows that have shifted around. Cocoa Melon remains overall the most watched original streaming series over the past three years with 1.5 billion hours watched. That's nearly double number two, so it's not going anywhere for a while. Ozarks in second place, Stranger Things in third, Bluey in fourth, Manifest moves up to fifth place, Cobra Kai and The Crown both dropping down a spot. They're at numbers six and seven. And that does it for a very extensive episode of Streaming Charts with Dan. I am going to try not to let it be two months before I do another one of these episodes, but it's just so hard because I'll prep a show and it'll get pushed back and there's so much going on, but I really do want to keep track of Suits and how it's doing a little bit closer to real time, especially since we do get some of those delays with the Nielsen numbers anyway. Looking generally at some things that are premiering in the next, let's say, week and a half or so through the end of the month, just a selection of things you can find on different streaming services. Star Wars Ahsoka, the latest live action Disney Star Wars series, will also be debuting on Tuesday on Disney+. Then on Friday, Vacation Friends 2, the sequel to Vacation Friends, naturally, debuts on Hulu. Also this upcoming Friday, the Adam Sandler produced film You Are So Not Invited to My Bot Mitzvah will be debuting on Netflix. Next Wednesday, August 30th, we'll see the debut of the final season of Archer on FX. And then next Thursday, August 31st, on Netflix will be the premiere of the live action adaptation of the anime series One Piece. Netflix has not had a great track record with live action anime adaptations. Let's see if this changes their luck. And that does it for streaming charts with Dan. Thank you so much for watching. Netflix with Dan, my box office show, will be coming out I think tomorrow on Monday because of some travel that I have planned. If not for some reason, then it will definitely be out on Tuesday. And then I've got movie news and reviews and all that stuff planned for the rest of this week and beyond. You never know what you're going to see here on the channel. Thanks so much for spending part of your day here with me talking about numbers and suits and secret invasions and all that stuff. Until next time, stay safe and I'll see you then. Bye. Dive into New Jersey's rich history and diverse heritage from colonial reenactments and Victorian architecture, scientific breakthroughs to the Underground Railroad, where the crossroads of the American Revolution, birthplace of the motion picture and home to the oldest lighthouse in the U.S. Explore our historic museums, view maritime marvels and travel insightful itineraries. Learn more at visitnj.org slash history."}, "podcast_summary": "In this edition of Streaming Charts with Dan, there are several exciting developments in the world of streaming. One standout is the unexpected success of the TV show Suits, which has surged in popularity, putting up impressive watch time numbers and outperforming expectations. Another noteworthy series is the much-anticipated Secret Invasion, the latest addition to the Marvel Cinematic Universe, which so far hasn't generated the numbers one might expect. On the movie front, Avatar: The Way of Water has been dominating the streaming charts, while Bluey, a popular animated series, has become a force to be reckoned with, even surpassing the long-standing powerhouse of Coco Melon. With new releases like Star Wars: Ahsoka, The Adam Sandler-produced film, You Are So Not Invited to My Bar Mitzvah, and the live-action adaptation of One Piece on the horizon, the streaming landscape promises continued excitement and surprises. Stay tuned for more developments in the world of streaming and join us next time for another edition of Streaming Charts with Dan.", "podcast_guest": "Zach Peter", "podcast_highlights": "Highlight 1: Suits, a legal drama series, has become a breakout hit on streaming platforms, putting up consistently high watch time numbers.\n\nHighlight 2: Suits has generated 61.6 million hours watched in its fourth week on the streaming charts, more than triple the second-place show.\n\nHighlight 3: Secret Invasion, an MCU show on Disney+, is not performing as well as expected, trailing behind other Marvel series in watch time.\n\nHighlight 4: Netflix's original series, Suits, is the second most watched library streaming series of the year, closing in on the top spot.\n\nHighlight 5: Netflix's market share has decreased from 31% to 20% since 2020, highlighting increased competition in the streaming industry."}